## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke-cinema.google_container_cluster.primary has changed
!   resource "google_container_cluster" "primary" {
        id                          = "projects/terrateam-362405/locations/us-central1/clusters/cinema"
        name                        = "cinema"
        # (27 unchanged attributes hidden)

!       node_pool {
            name                        = "core"
            # (7 unchanged attributes hidden)

!           autoscaling {
!               max_node_count       = 6 -> 12
!               min_node_count       = 4 -> 6
                # (2 unchanged attributes hidden)
            }

            # (3 unchanged blocks hidden)
        }

        # (19 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@terrateam-362405.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_project_service.enabled_apis["mesh.googleapis.com"] will be created
+   resource "google_project_service" "enabled_apis" {
+       disable_on_destroy = false
+       id                 = (known after apply)
+       project            = "terrateam-362405"
+       service            = "mesh.googleapis.com"
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/e5d136ba759df6d167527691eea63b053857c332" -> (known after apply)
!       name               = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/e5d136ba759df6d167527691eea63b053857c332" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJRkZWOWNhYWZQM1l3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTJOemd6TkRRM09EWXdOamd4TURFeU56VTNNQ0FYRFRJeU1Ea3hPREEwTkRjd04xb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EWTNPRE0wTkRjNE5qQTJPREV3TVRJM05UY3dnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRREhGQ1YxZnRGMFYyS2ViMjJJUXNrYi9wV08Kak13bjhkZ3lqQVZWWXM4amhwR2hqVTVjUFpBZ212cEJydDdGdGJDa25QVkZBdTJFdWlsQmJlZGhNYXlrZjRtago0SEE3UjBBeUVjRnBRRmRnRnZKbjJ1ZC9HY1k5Zzkva3FZV0U4bkJ5RVhIaUc0WUNVQXlHekxHYmdJWlU5Sy9kCjluQi9kektMM2tjN0tkRCsrSDcxNXpEZ1pTRVBnekYzOUhSaWZvWHpYWEpPWmZ6c3lCdm9RaDhWTHZTSVZkYUQKMm84OUdKeUNGNFg0KzU4UWVnTEJGRXVqQTRuMENiN2hXTXB5TjhObTJWV2t0NW4yWUcwMVdHNmYwWHFveXVQZgpIdUdLUFdnQzVJcE0rUW0xWDc2NUdwYVp0aHVVZDBzOVpoRWFhTDF1ZVVGcDZJR3ZKeTlaeWtSeng5VE5BZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQ0F5WWw4cG9JSXZIWTVyd0FrRkdXNApCMGJqb0VZVWJ3dWIwemZTV3BVV2V5a3hnc3JZQitpdWN6b3U1a0tNN1JsNEwyTW9tUnNtRXA5RTJPY3FGRDlJCkdIUTNWbkhTTGxoQTEvd2pvTmdud09OSEZDMnBuQkhhQ0RZSk10ZE14eXczcDJvQmxuN3NoSjFnd05uaGdYWjQKNVlhTi9VbzZhNU5FSzFJYk8xWXFlTlFkcjR2UlNlUG90cmlaLzJMdnNmandrOEdoZTJUcU5kcXBEZzBFQXNteQovR3p4WWJyOE9OR2p4RDNadCt3Sjd4Nm4zcmVTZHF6ZjVrVVJUazdUT28rb0c3bUxBeGd3bFZ1TGx3dkNpeUNMClkyVnc1Z2NIcitCdjFxVUpjc3ZUM0JKaUplUmIxQWpoOHExbjhOK3NKQm9XR0hCUXpCRWFRZ3JSdlk2UERvbEUKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-09-18T04:47:07Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_secret.external-dns-credentials will be updated in-place
!   resource "kubernetes_secret" "external-dns-credentials" {
!       data      = (sensitive value)
        id        = "dns/external-dns"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # null_resource.cluster1_hub_mesh_update will be created
+   resource "null_resource" "cluster1_hub_mesh_update" {
+       id       = (known after apply)
+       triggers = {
+           "command_sha" = "86a48fb45256102cff42357bb77c75afe4527da5"
        }
    }

  # module.asm.google_gke_hub_membership.membership[0] will be created
+   resource "google_gke_hub_membership" "membership" {
+       id            = (known after apply)
+       membership_id = "cinema-membership"
+       name          = (known after apply)
+       project       = "terrateam-362405"

+       endpoint {
+           gke_cluster {
+               resource_link = "//container.googleapis.com/projects/terrateam-362405/locations/us-central1/clusters/cinema"
            }
        }
    }

  # module.gke-cinema.data.google_compute_zones.available will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_zones" "available" {
+       id      = (known after apply)
+       names   = (known after apply)
+       project = "terrateam-362405"
+       region  = "us-central1"
    }

  # module.gke-cinema.data.google_container_engine_versions.region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "region" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1"
+       project                         = "terrateam-362405"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.data.google_container_engine_versions.zone will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "zone" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1-a"
+       project                         = "terrateam-362405"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.google_container_cluster.primary will be updated in-place
!   resource "google_container_cluster" "primary" {
        id                          = "projects/terrateam-362405/locations/us-central1/clusters/cinema"
!       min_master_version          = "1.24.3-gke.2100" -> (known after apply)
        name                        = "cinema"
        # (26 unchanged attributes hidden)

        # (20 unchanged blocks hidden)
    }

  # module.gke-cinema.random_shuffle.available_zones must be replaced
-/+ resource "random_shuffle" "available_zones" {
!       id           = "-" -> (known after apply)
!       input        = [
-           "us-central1-a",
-           "us-central1-b",
-           "us-central1-c",
-           "us-central1-f",
        ] -> (known after apply) # forces replacement
!       result       = [
-           "us-central1-a",
-           "us-central1-f",
-           "us-central1-c",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_command[0] is tainted, so must be replaced
-/+ resource "null_resource" "run_command" {
!       id       = "7328484179787657326" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 6 to add, 2 to change, 3 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
